//Дан масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47] Знайти суму та кількість позитивних елементів.
let arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];

let sum = 0;

let count = 0;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0) {
        sum += arr[i];
        count++;
    }
}

alert('Сума позитивних елементів = ' + sum + '\nКількість позитивних елементів = ' + count);

//Знайти мінімальний елемент масиву та його порядковий номер.
let min = Math.min(...arr);

let index = arr.indexOf(min);

alert('Мінімальний елемент масиву: ' + min + '\nПорядковий номер мінімального елементу масиву: ' + index);

//Знайти максимальний елемент масиву та його порядковий номер.
let max = Math.max(...arr);

let indexx = arr.indexOf(max);

alert('Максимальний елемент масиву: ' + max + '\nПорядковий номер максимального елементу масиву: ' + indexx);

//Визначити кількість негативних елементів.
let countt = 0;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] < 0) {
        countt++;
    }
}

alert('Кількість негативних елементів: ' + countt);

//Знайти кількість непарних позитивних елементів.
let counttt = 0;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0 && arr[i] % 2 !== 0) {
        counttt++;
    }
}

alert('Кількість непарних позитивних елементів: ' + counttt);

//Знайти кількість парних позитивних елементів.
let countttt = 0;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0 && arr[i] % 2 === 0) {
        countttt++;
    }
}

alert('Кількість парних позитивних елементів: ' + countttt);

//Знайти суму парних позитивних елементів.
let summ = 0;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0 && arr[i] % 2 === 0) {
        summ += arr[i];
    }
}

alert('Сума парних позитивних елементів: ' +summ);

//Знайти суму непарних позитивних елементів.
let summm = 0;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0 && arr[i] % 2 !== 0) {
        summm += arr[i];
    }
}

alert('Сума непарних позитивних елементів: ' + summm);

//Знайти добуток позитивних елементів.
let product = 1;

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 0) {
        product *= arr[i];
    }
}

alert('Добуток позитивних елементів: ' + product);

//Знайти найбільший серед елементів масиву, інші обнулити.
let maxElement = Math.max(...arr);

for (let i = 0; i < arr.length; i++) {
    if (arr[i] !== maxElement) {
        arr[i] = 0;
    }
}

alert('Найбільший елемент серед елементів масиву: ' + maxElement + '\nМасив після обнулення: ' + arr);
